---
kind: property
id: P:Autodesk.Revit.DB.Path3d.CurveLoop(System.Int32)
source: html/67e85c2c-5fe2-85a7-ea52-0fe83203021e.htm
---
# Autodesk.Revit.DB.Path3d.CurveLoop Property

Get the Curve Loop of Path3d via index.

## Syntax (C#)
```csharp
public CurveArray this[
	int index
] { get; }
```

## Parameters
- **index** (`System.Int32`)

## Remarks
Returns the index order Curve Loop of Path3d.